---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.DpartOriginalType
source: html/8f83503f-7db3-643e-840f-d06fb0004eda.htm
---
# Autodesk.Revit.DB.ParameterTypeId.DpartOriginalType Property

"Original Type"

## Syntax (C#)
```csharp
public static ForgeTypeId DpartOriginalType { get; }
```